app/controllers/registrations_controller.rb

INSERT INTO "users" ("uid", "encrypted_password", "name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @resource = User.new(user_params)

    if @resource.save